Public Attributes | List of all members
API_HatchQuantity Struct Reference
Element Manager API
Describes the different calculated values for fills. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | surface
area of the fill
double  | perimeter
perimeter of the fill
double  | holesPrm
perimeter of holes in the fill
double  | holesSurf
area of holes in the fill
Detailed Description
Describes the different calculated values for fills.
Remarks
See also the fill parameters for listing in Appendix A of the GDL Reference manual.
Member Data Documentation
◆ holesPrm
 API_HatchQuantity::holesPrm
perimeter of holes in the fill
◆ holesSurf
 API_HatchQuantity::holesSurf
area of holes in the fill
◆ perimeter
 API_HatchQuantity::perimeter
perimeter of the fill
◆ surface
 API_HatchQuantity::surface
area of the fill